// 2 სავარჯიშო

let name = "gio";
let age = "11";
let city = "wkaltubo";

// 3 სავარჯიშო

const height = 1.55;
const country = "Georgia";
const yearofbirth = 2013;

// 4 სავარჯიშო

// let არის ცვლადი რომლის მნიშვნელობა შეიძლება შეიცვალოს მაგრამ ხელახლა გამოცხადება შეუძლებელია.

// 5 სავარჯიშო

// const არის ცვლადი რომლის მნიშვნელობა გამოცხადების შემდეგ ვერ შეიცვლება

// 6 სავარჯიშო

// var აქვს ფუნქციის სკოუპი და შეიძლება ხელახლა გამოცხადდეს

// let აქვს ბლოკ/სკოუპი და ხელახალი გამოცხადება შეუძლებელია


