
# დავალება: შექმენით ფუნქცია რომელიც, გამოიტანს ლუწ რიცხვზე even, ხოლო კენტზე odd-ს.

def giorgi(num1):
    if num1 % 2 == 0:
         print("even")
    else:
        print("odd")

giorgi(10)






# დავალება: შექმენით ფუნქცია, რომელიც გამოძახებისას მომხმარებელს შემატანინებთ რიცხვს, თუ რიცხვი იყო დადებითი, დაუპრინტეთ მისი უარყოფითი ვარიანტი, ხოლო თუ იყო უარყოფითი, დაუპრინტეთ დადებითი ვარიანტი.

def giorgi(num1):
    if num1 < 0:
        print(num1 * -1)
    else:
      print(num1 * -1)

giorgi(-10)

# დავალება: შექმენით ფუნქცია, რომელიც გებულობს, მომხმაებლის შემოტანილი რიცხვი, კენტია თუ ლუწი, ხოლო შემდეგ უპრინტავს მომხმარებელს

def giorgi(num1):
    if num1 % 2 == 0:
       print("even")
    else:
       print("odd")

giorgi(10)